# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 10  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1 # layer channel multiple
anchors:
  - [3,4, 4,8, 8,7]  # P3/8
  - [7,14, 16,9, 14,18]  # P4/16
  - [29,15, 24,33, 55,38]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 6, 2, 2]],  # 0-P1/2 - 320
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4 - 160
   [-1, 1, MIRB, [64, 128, 1, 1, nn.ReLU()]],
   [-1, 1, C3_CBAM, [64]],
   [-1, 1, Conv, [128, 3, 2]],  # 4-P3/8 - 80
   [-1, 1, MIRB, [128, 256, 1, 1, nn.ReLU()]],
   [-1, 1, C3_CBAM, [256]],
   [-1, 1, PISPPF, [128]],  # 7
  ]
# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [64, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #9 - 160
   [[-1, 3], 1, Concat, [1]],  # cat backbone P2

   [-1, 1, MIRB, [126, 256, 1, 1, nn.ReLU()]], # 10 -> out 128

   [-1, 1, C3_CBAM, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 6], 1, Concat, [1]],

   [-1, 1, MIRB, [512, 512, 1, 1, nn.ReLU()]], #14 -> out 512

   [-1, 1, C3_CBAM, [256]], #15 -> out 256

   [[10, 15, 14], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
