# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 1, None, 1]],  # 0
  
   [-1, 1, GhostConv, [64, 3, 2, 2]],  # 1-P1/2
   [-1, 1, GhostConv, [64, 3, 1, 2]],    
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, GhostConv, [32, 3, 1, 2]],
   [-1, 1, GhostConv, [32, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, C3Ghost, [64]],  # 8
   [-1, 1, CBAM, [64, 64]],

   
   [-1, 1, MP, []],  # 10-P3/8
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-3, 1, GhostConv, [32, 3, 2, 2]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],

   [-1, 1, GhostConv, [64, 1, 1, 1]],
   [-2, 1, GhostConv, [64, 1, 1, 1]],
   [-1, 1, GhostConv, [64, 3, 1, 2]],
   [-1, 1, GhostConv, [64, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, C3Ghost, [128]],  # 20
   [-1, 1, CBAM, [128, 128]],
   
   [-1, 1, MP, []],  # 22-P4/16
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-3, 1, GhostConv, [64, 3, 2, 2]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],

   [-1, 1, GhostConv, [128, 1, 1, 1]],
   [-2, 1, GhostConv, [128, 1, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1, 2]],
   [-1, 1, GhostConv, [128, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, C3Ghost, [256]],  # 32
   [-1, 1, CBAM, [256, 256]],
   
   [-1, 1, MP, []],  # 34-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, GhostConv, [256, 3, 1, 4]],
   [-1, 1, GhostConv, [256, 3, 1, 4]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, GhostConv, [512, 1, 1, 4]],  # 40
  ]

# yolov7-tiny head
head:
  [[-1, 1, GhostSPPCSPC, [256]],  # 41
   [-1, 1,SwinTransformerBlock, [64, 1, 1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [33, 1, Conv, [128, 1, 1, None, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, GhostConv, [64, 3, 1, 2]],
   [-1, 1, GhostConv, [64, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 52
  
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [21, 1, Conv, [64, 1, 1, None, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, GhostConv, [32, 3, 1, 2]],
   [-1, 1, GhostConv, [32, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 62
   
   [-1, 1, GhostConv, [128, 3, 2, 2]],
   [[-1, 52], 1, Concat, [1]],
   [-1, 1, GhostConv, [128, 1, 1, 2]],
   [-1, 1, CBAM, [128, 128]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, GhostConv, [64, 3, 1, 2]],
   [-1, 1, GhostConv, [64, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 72
   
   [-1, 1, GhostConv, [256, 3, 2, 2]],
   [[-1, 42], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1, 2]],
   [-1, 1, CBAM, [256, 256]],
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, GhostConv, [128, 3, 1, 2]],
   [-1, 1, GhostConv, [128, 3, 1, 2]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, GhostConv, [256, 1, 1, 2]],  # 82
      
   [62, 1, RepConv, [128, 3, 1, None, 2]],
   [72, 1, RepConv, [256, 3, 1, None, 8]],
   [82, 1, GhostConv, [512, 3, 1, 8]],

   [[83,84,85], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
