# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [3,4, 4,8, 8,7]  # P3/8
  - [7,14, 16,9, 14,18]  # P4/16
  - [29,15, 24,33, 55,38]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 1, None, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2, None, 1]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1, None, 1]],    
   
   [-1, 1, Conv, [64, 3, 2, None, 2]], # 3-P2/4

   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, DWSConv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 9
   [-1, 1, CBAM, [128]],
   
   [-1, 1, MP, []],  # 11-P3/8

   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, DWSConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 17
   [-1, 1, CBAM, [256]],
   
   [-1, 1, MP, []],  # 19- P4/16

   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-2, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, DWSConv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1]],  # 25
   [-1, 1, CBAM, [512]],
  ]

# yolov7-tiny head
head:
  [[-1, 1, PISPPF, [256]],  # 27
  
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [18, 1, Conv, [128, 1, 1, None, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]], # 31
   
   [-1, 1, DWSConv, [128, 3, 1]],  # 32
  
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [10, 1, Conv, [64, 1, 1, None, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, DWSConv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 42
   [-1, 1, CBAM, [64]],
   
   [-1, 1, Conv, [128, 3, 2, None, 1]],
   [[-1, 32], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, DWSConv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 51
   [-1, 1, CBAM, [128]],
   
   [-1, 1, Conv, [256, 3, 2, None, 1]],
   [[-1, 27], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-2, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, DWSConv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 60
   [-1, 1, CBAM, [256]],
      
   [43, 1, DWSConv, [128, 1, 1]],
   [52, 1, DWSConv, [256, 1, 1]],
   [61, 1, DWSConv, [512, 1, 1]],

   [[62,63,64], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
