# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [3,5, 4,10, 8,7]  # P3/8
  - [15,9, 9,16, 23,14]  # P4/16
  - [20,30, 43,24, 69,61]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 1, None, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2, None, 1]],  # 1-P1/2
   [-1, 1, Conv, [64, 3, 1, None, 1]],    
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 8
   
   [-1, 1, MP, []],  # 9-P3/8
   [-1, 1, Conv, [32, 1, 1, None, 4]],
   [-3, 1, Conv, [32, 3, 2, None, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [64, 1, 1, None, 4]],
   [-2, 1, Conv, [64, 1, 1, None, 4]],
   [-1, 1, Conv, [64, 3, 1, None, 4]],
   [-1, 1, Conv, [64, 3, 1, None, 4]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 4]],  # 18
   [-1, 1, CBAM, [128]],
   
   [-1, 1, MP, []],  # 20-P4/16
   [-1, 1, Conv, [64, 1, 1, None, 4]],
   [-3, 1, Conv, [64, 3, 2, None, 1]],
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, Conv, [128, 1, 1, None, 4]],
   [-2, 1, Conv, [128, 1, 1, None, 4]],
   [-1, 1, Conv, [128, 3, 1, None, 4]],
   [-1, 1, Conv, [128, 3, 1, None, 4]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 4]],  # 29
   [-1, 1, CBAM, [256]],
   
   [-1, 1, MP, []],  # 31-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, Conv, [256, 3, 1, None, 1]],
   [-1, 1, Conv, [256, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1]],  # 37
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]], #46
  
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [30, 1, Conv, [128, 1, 1, None, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 56
  
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [19, 1, Conv, [64, 1, 1, None, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [32, 1, 1, None, 4]],
   [-2, 1, Conv, [32, 1, 1, None, 4]],
   [-1, 1, Conv, [32, 3, 1, None, 4]],
   [-1, 1, Conv, [32, 3, 1, None, 4]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 4]],  # 66
   
   [-1, 1, Conv, [128, 3, 2, None, 1]],
   [[-1, 56], 1, Concat, [1]],
   [-1, 1, CBAM, [256]],
   
   [-1, 1, Conv, [64, 1, 1, None, 4]],
   [-2, 1, Conv, [64, 1, 1, None, 4]],
   [-1, 1, Conv, [64, 3, 1, None, 4]],
   [-1, 1, Conv, [64, 3, 1, None, 4]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 4]],  # 75
   
   [-1, 1, Conv, [256, 3, 2, None, 1]],
   [[-1, 46], 1, Concat, [1]],
   [-1, 1, CBAM, [512]],
   
   [-1, 1, Conv, [128, 1, 1, None, 4]],
   [-2, 1, Conv, [128, 1, 1, None, 4]],
   [-1, 1, Conv, [128, 3, 1, None, 4]],
   [-1, 1, Conv, [128, 3, 1, None, 4]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 4]],  # 84
      
   [66, 1, Conv, [128, 3, 1, None, 1]],
   [75, 1, Conv, [256, 3, 1, None, 1]],
   [84, 1, Conv, [512, 3, 1, None, 1]],

   [[85,86,87], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
