# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [3,5, 4,10, 8,7]  # P3/8
  - [15,9, 9,16, 23,14]  # P4/16
  - [20,30, 43,24, 69,61]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 1, None, 1]],  # 0
  
   [-1, 1, Conv, [64, 3, 2, None, 1]],  # 1-P1/2
   [-1, 1, DWConv, [64, 3, 1]],    
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 8
   
   [-1, 1, MP, []],  # 9-P3/8
   [-1, 1, Conv, [32, 1, 1, None, 8]],
   [-3, 1, Conv, [32, 3, 2, None, 1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 8]],

   [-1, 1, Conv, [64, 1, 1, None, 8]],
   [-2, 1, Conv, [64, 1, 1, None, 8]],
   [-1, 1, Conv, [64, 3, 1, None, 8]],
   [-1, 1, Conv, [64, 3, 1, None, 8]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 8]],  # 19
   [-1, 1, CBAM, [128]],
   
   [-1, 1, MP, []],  # 21-P4/16
   [-1, 1, Conv, [64, 1, 1, None, 8]],
   [-3, 1, Conv, [64, 3, 2, None, 1]],
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 8]],

   [-1, 1, Conv, [128, 1, 1, None, 8]],
   [-2, 1, Conv, [128, 1, 1, None, 8]],
   [-1, 1, Conv, [128, 3, 1, None, 8]],
   [-1, 1, Conv, [128, 3, 1, None, 8]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 8]],  # 31
   [-1, 1, CBAM, [256]],
   
   [-1, 1, MP, []],  # 33-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, Conv, [256, 3, 1, None, 1]],
   [-1, 1, Conv, [256, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1]],  # 39
  ]

# yolov7-tiny head
head:
  [[-1, 1, SPPCSPC, [256]],  # 40
  
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [32, 1, Conv, [128, 1, 1, None, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 50
  
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [20, 1, Conv, [64, 1, 1, None, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 60
   
   [-1, 1, Conv, [128, 3, 2, None, 1]],
   [[-1, 50], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, CBAM, [128]],
   
   [-1, 1, Conv, [64, 1, 1, None, 8]],
   [-2, 1, Conv, [64, 1, 1, None, 8]],
   [-1, 1, Conv, [64, 3, 1, None, 8]],
   [-1, 1, Conv, [64, 3, 1, None, 8]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 8]],  # 70
   
   [-1, 1, Conv, [256, 3, 2, None, 1]],
   [[-1, 40], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, CBAM, [256]],
   
   [-1, 1, Conv, [128, 1, 1, None, 8]],
   [-2, 1, Conv, [128, 1, 1, None, 8]],
   [-1, 1, Conv, [128, 3, 1, None, 8]],
   [-1, 1, Conv, [128, 3, 1, None, 8]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 8]],  # 80
      
   [60, 1, Conv, [128, 3, 1, None, 1]],
   [70, 1, Conv, [256, 3, 1, None, 4]],
   [80, 1, Conv, [512, 3, 1, None, 4]],

   [[81,82,83], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
