# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2, None, 1]],  # 1-P2/4  
   [-1, 1, Conv, [64, 3, 1, None, 1]],  
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, CBAM, [32]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, CBAM, [32]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 10
   
   [-1, 1, MP, []],  # 11-P3/8
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, CBAM, [64]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, CBAM, [64]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 19
   [-1, 1, CBAM, [128]],
   
   [-1, 1, MP, []],  # 21-P4/16
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-2, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, Conv, [128, 3, 1, None, 1]],
   [-1, 1, CBAM, [128]],
   [-1, 1, Conv, [128, 3, 1, None, 1]],
   [-1, 1, CBAM, [128]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 29
   [-1, 1, CBAM, [256]],
   
   [-1, 1, MP, []],  # 31-P5/32
   [-1, 1, Conv, [256, 1, 1, None, 1]],
   [-2, 1, Conv, [256, 1, 1, None, 1]],
   [-1, 1, Conv, [256, 3, 1, None, 1]],
   [-1, 1, CBAM, [256]],
   [-1, 1, Conv, [256, 3, 1, None, 1]],
   [-1, 1, CBAM, [256]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1]],  # 39
  ]

# yolov7-tiny head
head:
  [[-1, 1, SPPCSPC, [256]], # 40
  
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [30, 1, Conv, [128, 1, 1, None, 1]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, CBAM, [64]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, CBAM, [64]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 52
  
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [20, 1, Conv, [64, 1, 1, None, 1]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [32, 1, 1, None, 1]],
   [-2, 1, Conv, [32, 1, 1, None, 1]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, CBAM, [32]],
   [-1, 1, Conv, [32, 3, 1, None, 1]],
   [-1, 1, CBAM, [32]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1]],  # 64
   
   [-1, 1, Conv, [128, 3, 2, None, 1]],
   [[-1, 52], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 1, 1, None, 1]],
   [-2, 1, Conv, [64, 1, 1, None, 1]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, CBAM, [64]],
   [-1, 1, Conv, [64, 3, 1, None, 1]],
   [-1, 1, CBAM, [64]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1]],  # 74
   
   [-1, 1, Conv, [256, 3, 2, None, 1]],
   [[-1, 40], 1, Concat, [1]],
   
   [-1, 1, Conv, [128, 1, 1, None, 1]],
   [-2, 1, Conv, [128, 1, 1, None, 1]],
   [-1, 1, Conv, [128, 3, 1, None, 1]],
   [-1, 1, CBAM, [128]],
   [-1, 1, Conv, [128, 3, 1, None, 1]],
   [-1, 1, CBAM, [128]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1]],  # 84
      
   [64, 1, Conv, [128, 3, 1, None, 1]],
   [-1, 3, CBAM, [128]], # 86
   [74, 1, Conv, [256, 3, 1, None, 1]],
   [-1, 3, CBAM, [256]], # 88
   [84, 1, Conv, [512, 3, 1, None, 1]],
   [-1, 3, CBAM, [512]], # 90

   [[86,88,90], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
